
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15128762703)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.bootstrap.data.google_iam_role.roles_storage_object_user: Reading...
module.bootstrap.data.google_project.project: Reading...
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Reading...
module.bootstrap.google_service_account.terraform_executor: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_service_account.cloudbuild_service_account: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_iam_workload_identity_pool.github_actions_pool: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool]
module.bootstrap.google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/secretmanager.googleapis.com]
module.bootstrap.google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudbuild.googleapis.com]
module.bootstrap.google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=portfolio-460206/iam.googleapis.com]
module.bootstrap.google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudresourcemanager.googleapis.com]
module.bootstrap.data.google_project.project: Read complete after 1s [id=projects/portfolio-460206]
module.bootstrap.google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=portfolio-460206/iap.googleapis.com]
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Read complete after 1s [id=projects/186242794041/secrets/github-host-github-oauthtoken-f6b0df/versions/1]
module.bootstrap.google_project_service.service["sts.googleapis.com"]: Refreshing state... [id=portfolio-460206/sts.googleapis.com]
module.bootstrap.google_project_service.service["storage.googleapis.com"]: Refreshing state... [id=portfolio-460206/storage.googleapis.com]
module.bootstrap.google_project_service.service["run.googleapis.com"]: Refreshing state... [id=portfolio-460206/run.googleapis.com]
module.bootstrap.data.google_iam_role.roles_storage_object_user: Read complete after 1s [id=roles/storage.objectUser]
module.bootstrap.google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=portfolio-460206/artifactregistry.googleapis.com]
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/connections/github-connection]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/logging.logWriter"]: Refreshing state... [id=portfolio-460206/roles/logging.logWriter/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Refreshing state... [id=portfolio-460206/roles/run.admin/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=portfolio-460206/roles/secretmanager.secretAccessor/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/artifactregistry.writer"]: Refreshing state... [id=portfolio-460206/roles/artifactregistry.writer/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/cloudbuild.workerPoolUser"]: Refreshing state... [id=portfolio-460206/roles/cloudbuild.workerPoolUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=portfolio-460206/roles/iam.serviceAccountUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_project_iam_member.terraform_executor: Refreshing state... [id=portfolio-460206/roles/owner/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_project_iam_custom_role.custom_storage_object_user: Refreshing state... [id=projects/portfolio-460206/roles/customStorageObjectUser]
module.bootstrap.google_iam_workload_identity_pool_provider.github_actions_pool_provider: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool/providers/github-actions-pool-provider]
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/connections/github-connection/repositories/portfolio]
module.bootstrap.google_storage_bucket_iam_member.terraform_executor_storage_object_user: Refreshing state... [id=b/portfolio-shared-terraform-backend/projects/portfolio-460206/roles/customStorageObjectUser/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_service_account_iam_member.terraform_workload_identity_user: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/186242794041/locations/global/workloadIdentityPools/github-actions-wip-pool/attribute.repository/goda6565/portfolio]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection must be replaced
-/+ resource "google_cloudbuildv2_connection" "github_connection" {
      - annotations           = {} -> null
      ~ create_time           = "2025-05-19T00:49:28.210981729Z" -> (known after apply)
      - disabled              = false -> null
      ~ effective_annotations = {} -> (known after apply)
      ~ etag                  = "R4KnHWzIguFPDyjrfxU4Ki59tvk9XqmxFIeXnCXC1uM" -> (known after apply)
      ~ id                    = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection" -> (known after apply)
      ~ installation_state    = [
          - {
              - stage      = "COMPLETE"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ location              = "asia-northeast1" -> "us-west2" # forces replacement
        name                  = "github-connection"
      ~ reconciling           = false -> (known after apply)
      ~ update_time           = "2025-05-19T00:49:29.586403361Z" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ github_config {
            # (1 unchanged attribute hidden)

          ~ authorizer_credential {
              + username                   = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository must be replaced
-/+ resource "google_cloudbuildv2_repository" "github_repository" {
      - annotations           = {} -> null
      ~ create_time           = "2025-05-20T04:10:51.600982402Z" -> (known after apply)
      ~ effective_annotations = {} -> (known after apply)
      ~ etag                  = "WUDdtaJ0GWwVYYZlWml2gmOP9lhDa8ToSCU54LULrRg" -> (known after apply)
      ~ id                    = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection/repositories/portfolio" -> (known after apply)
      ~ location              = "asia-northeast1" -> (known after apply)
        name                  = "portfolio"
      ~ parent_connection     = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection" -> (known after apply) # forces replacement
      ~ update_time           = "2025-05-20T04:10:53.074094822Z" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "portfolio"
          + owner = "goda6565"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Destroying... [id=projects/portfolio-460206/locations/asia-northeast1/connections/github-connection/repositories/portfolio]
module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger: Creating...
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Destruction complete after 1s
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Destroying... [id=projects/portfolio-460206/locations/asia-northeast1/connections/github-connection]
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Destruction complete after 2s
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Creating...
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Still creating... [00m10s elapsed]
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Creation complete after 11s [id=projects/portfolio-460206/locations/us-west2/connections/github-connection]
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Creating...
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Still creating... [00m10s elapsed]
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Creation complete after 10s [id=projects/portfolio-460206/locations/us-west2/connections/github-connection/repositories/portfolio]
╷
│ Error: Error creating Trigger: googleapi: Error 400: Repository mapping does not exist. Please visit https://console.cloud.google.com/cloud-build/triggers;region=us-west2/connect?project=186242794041 to connect a repository to your project
│ 
│   with module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger,
│   on ../modules/cloudbuild/triggers/google_cloudbuild_trigger.tf line 1, in resource "google_cloudbuild_trigger" "github_trigger":
│    1: resource "google_cloudbuild_trigger" "github_trigger" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":28,"Program":"tfcmt","SHA1":"fa49ed2874f450792aabd85dcec3cb8a92f5c257","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->